{"keras_version": "2.2.4", "config": {"layers": [{"config": {"dtype": "int32", "name": "input_1", "batch_input_shape": [null, 50], "sparse": false}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"dtype": "int32", "name": "input_2", "batch_input_shape": [null, 50], "sparse": false}, "name": "input_2", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"output_dim": 300, "input_dim": 79197, "name": "embedding_1", "trainable": false, "embeddings_constraint": null, "embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null, "embeddings_regularizer": null, "dtype": "float32", "mask_zero": false, "input_length": 50, "batch_input_shape": [null, 50]}, "name": "embedding_1", "inbound_nodes": [[["input_1", 0, 0, {}]], [["input_2", 0, 0, {}]]], "class_name": "Embedding"}, {"config": {"bias_regularizer": null, "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv1d_1", "trainable": true, "activity_regularizer": null, "filters": 128, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_size": [3], "bias_constraint": null, "padding": "same", "activation": "relu", "kernel_constraint": null, "use_bias": true, "dilation_rate": [1]}, "name": "conv1d_1", "inbound_nodes": [[["embedding_1", 0, 0, {}]], [["embedding_1", 1, 0, {}]]], "class_name": "Conv1D"}, {"config": {"strides": [2], "padding": "valid", "data_format": "channels_last", "pool_size": [2], "name": "max_pooling1d_1", "trainable": true}, "name": "max_pooling1d_1", "inbound_nodes": [[["conv1d_1", 0, 0, {}]], [["conv1d_1", 1, 0, {}]]], "class_name": "MaxPooling1D"}, {"config": {"layer": {"config": {"bias_regularizer": null, "dropout": 0.0, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "trainable": true, "activity_regularizer": null, "unroll": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activation": "tanh", "kernel_constraint": null, "stateful": false, "use_bias": true, "unit_forget_bias": true, "implementation": 1, "units": 256, "return_sequences": false, "kernel_regularizer": null, "go_backwards": false, "recurrent_regularizer": null, "recurrent_constraint": null, "return_state": false, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0}, "class_name": "LSTM"}, "trainable": true, "merge_mode": "concat", "name": "bidirectional_1"}, "name": "bidirectional_1", "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]], [["max_pooling1d_1", 1, 0, {}]]], "class_name": "Bidirectional"}, {"config": {"function": ["4wEAAAAAAAAAAQAAAAcAAABTAAAAczgAAAB0AABqAQB0AABqAgB0AABqAwB8AABkAQAZfAAAZAIA\nGRiDAQBkAwBkAgBkBABkBQCDAQILgwEAUykGTukAAAAA6QEAAADaBGF4aXPaCGtlZXBkaW1zVCkE\n2gFL2gNleHDaA3N1bdoDYWJzKQHaAXipAHIKAAAA+h88aXB5dGhvbi1pbnB1dC0xMy0xMjUzODdm\nOTVkOTk+2gg8bGFtYmRhPhoAAABzAAAAAA==\n", null, null], "arguments": {}, "output_shape_type": "lambda", "function_type": "lambda", "name": "lambda_1", "trainable": true, "output_shape": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcxIAAAB8AABkAQAZZAEAGWQCAGYCAFMpA07pAAAAAOkBAAAA\nqQApAdoBeHIDAAAAcgMAAAD6HzxpcHl0aG9uLWlucHV0LTEzLTEyNTM4N2Y5NWQ5OT7aCDxsYW1i\nZGE+GwAAAHMAAAAA\n", null, null]}, "name": "lambda_1", "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["bidirectional_1", 1, 0, {}]]], "class_name": "Lambda"}], "output_layers": [["lambda_1", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "name": "model_1"}, "backend": "tensorflow", "class_name": "Model"}