{"class_name": "Model", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"name": "input_1", "dtype": "int32", "sparse": false, "batch_input_shape": [null, 50]}}, {"class_name": "InputLayer", "name": "input_2", "inbound_nodes": [], "config": {"name": "input_2", "dtype": "int32", "sparse": false, "batch_input_shape": [null, 50]}}, {"class_name": "Embedding", "name": "embedding_1", "inbound_nodes": [[["input_1", 0, 0, {}]], [["input_2", 0, 0, {}]]], "config": {"trainable": false, "embeddings_constraint": null, "activity_regularizer": null, "input_length": 50, "name": "embedding_1", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "mask_zero": false, "input_dim": 79197, "dtype": "float32", "output_dim": 300, "embeddings_regularizer": null, "batch_input_shape": [null, 50]}}, {"class_name": "Conv1D", "name": "conv1d_1", "inbound_nodes": [[["embedding_1", 0, 0, {}]], [["embedding_1", 1, 0, {}]]], "config": {"activity_regularizer": null, "use_bias": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "relu", "trainable": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "kernel_constraint": null, "strides": [1], "filters": 128, "name": "conv1d_1", "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [3]}}, {"class_name": "MaxPooling1D", "name": "max_pooling1d_1", "inbound_nodes": [[["conv1d_1", 0, 0, {}]], [["conv1d_1", 1, 0, {}]]], "config": {"pool_size": [2], "strides": [2], "name": "max_pooling1d_1", "data_format": "channels_last", "trainable": true, "padding": "valid"}}, {"class_name": "Bidirectional", "name": "bidirectional_1", "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]], [["max_pooling1d_1", 1, 0, {}]]], "config": {"layer": {"class_name": "LSTM", "config": {"unit_forget_bias": true, "return_state": false, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "tanh", "trainable": true, "kernel_regularizer": null, "recurrent_constraint": null, "kernel_constraint": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "unroll": false, "activity_regularizer": null, "implementation": 1, "use_bias": true, "units": 256, "go_backwards": false, "stateful": false, "dropout": 0.0, "bias_constraint": null, "recurrent_regularizer": null}}, "name": "bidirectional_1", "trainable": true, "merge_mode": "concat"}}, {"class_name": "Lambda", "name": "lambda_1", "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["bidirectional_1", 1, 0, {}]]], "config": {"arguments": {}, "function": ["4wEAAAAAAAAAAQAAAAcAAABTAAAAczgAAAB0AABqAQB0AABqAgB0AABqAwB8AABkAQAZfAAAZAIA\nGRiDAQBkAwBkAgBkBABkBQCDAQILgwEAUykGTukAAAAA6QEAAADaBGF4aXPaCGtlZXBkaW1zVCkE\n2gFL2gNleHDaA3N1bdoDYWJzKQHaAXipAHIKAAAA+h88aXB5dGhvbi1pbnB1dC0xMy0xMjUzODdm\nOTVkOTk+2gg8bGFtYmRhPhoAAABzAAAAAA==\n", null, null], "output_shape": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcxIAAAB8AABkAQAZZAEAGWQCAGYCAFMpA07pAAAAAOkBAAAA\nqQApAdoBeHIDAAAAcgMAAAD6HzxpcHl0aG9uLWlucHV0LTEzLTEyNTM4N2Y5NWQ5OT7aCDxsYW1i\nZGE+GwAAAHMAAAAA\n", null, null], "function_type": "lambda", "name": "lambda_1", "trainable": true, "output_shape_type": "lambda"}}], "name": "model_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["lambda_1", 0, 0]]}}